plastikman/OpenBreath/sdkconfig.defaults
# OpenBreath default sdkconfig — ESP32-C3-MINI-1 (4MB flash)
CONFIG_IDF_TARGET="esp32c3"

# Flash / partitions
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Size-optimize (the app slot is ~1.8MB; stock image is ~1.3MB)
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# Console on UART0 (CH340K USB-C bridge, GPIO21/20). The C3 native USB-Serial-JTAG
# is NOT usable here: its D-/D+ pads are GPIO18/19 and GPIO18 drives the heater SSR.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# Task watchdog on — a hung control loop must not leave the heater energized.
# (pb_control subscribes via esp_task_wdt_add and pets it each loop.)
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_PANIC=y

# HTTP server: phone browsers send large header sets on POST — the 512B default
# request-header buffer overflows ("header fields are too long") when submitting
# the portal form. Bump it.
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048
